{
  "articles": [
    {
      "title": "As a Designer, I Refuse to Call People ‘Users’1",
      "content": "ve worked in UX for the better part of a decade. From now on, I plan to remove the word “user” and any associated terms—like “UX” and “user experience”—from my vocabulary. It’ll take time. I’ll start by trying to avoid using them in conversations at work. I’ll erase them from my LinkedIn profile. I’ll find new ways to describe my job when making small talk. I will experiment and look for something better.\n\nI don’t have any strong alternatives to offer right now, but I’m confident I’ll find some. I think of it as a challenge. The U-words are everywhere in tech, but they no longer reflect my values or my approach to design and technology. I can either keep using language I disagree with, or I can begin to search for what’s next. I choose to search.",
      "date": "2019-03-28",
      "author": "Adam Leftonggg",
      "image": "http://www.starspangledbannerlivingflag.org/wp-content/uploads/2018/09/aboutus-hyderabad.jpg",
      "tags": [],
      "id": "_8j39hx0"
    },
    {
      "title": "Create A REST API With JSON Server",
      "content": "his post has been published first on CodingTheSmartWay.com.\n\nA common task for front-end developers is to simulate a backend REST service to deliver some data in JSON format to the front-end application and make sure everything is working as expected.\n \n Of course you can setup a full backend server, e.g. by using Node.js, Express and MongoDB. However this takes some time and a much simpler approach can help to speed up front-end development time. \n \n JSON Server is a simple project that helps you to setup a REST API with CRUD operations very fast. The project website can be found at https://github.com/typicode/json-server.\n \n In the following you’ll lean how to setup JSON server and publish a sample REST API. Furthermore you’ll see how to use another library, Faker.js, to generate fake data for the REST API which is exposed by using JSON server.",
      "date": "2019-03-28",
      "author": "Sebastian Eschweiler",
      "image": "https://sutoprise.files.wordpress.com/2014/04/restbanner.png",
      "tags": [
        "javascript"
      ],
      "id": "_rkf0wce"
    },
    {
      "title": "Q&A: Instagram’s New Head of Product, Vishal Shah",
      "content": "At the end of 2018, Instagram overhauled its leadership in the wake of the sudden departure of its two cofounders, Kevin Systrom and Mike Krieger.\n\nPart of that overhaul included the elevation of Vishal Shah, a longtime Facebook employee who previously ran Instagram’s business products, to the Head of Product role. Shah reports to Instagram boss Adam Mosseri, who in turn reports to Facebook CEO Mark Zuckerberg.\n\nA specific area of focus for Shah over the past couple of years has been shopping on Instagram. After letting brands originally just add product tags to their photos, Instagram took the plunge this week by opening up the ability to complete purchases inside the app.\n\nShah sees e-commerce on Instagram as potentially the next great revenue driver after advertising. And that’s no small statement: Some analyst projections estimate that if Instagram were to be spun out of its Facebook parent company, it would already be at least a $100 billion business.\n\n“If you look at overall commerce, it’s a larger part of GDP (gross domestic product) than marketing is today,” Shah told Cheddar. “E-commerce is a smaller part of overall commerce and mobile is even smaller. So I think there’s a while before we can get to a place where it is as meaningful as our ads business today. But the reason we’re excited about the opportunity is I think the market is quite, quite large.”\n\nOn the heels of Instagram’s shopping announcement, Shah recently sat down for a wide-ranging interview with Cheddar’s Alex Heath and Michelle Castillo at Instagram’s New York City office. Discussed topics include the business opportunity Instagram sees in e-commerce, the state of IGTV, the departure of Instagram’s two cofounders, Facebook’s controversial plan to unify its messaging apps, Instagram’s approach to product development, and much more.\n\nThe following interview has been lightly edited for length and clarity.",
      "date": "2019-03-28",
      "author": "Alex Heath",
      "image": "https://i0.wp.com/cmgventures.com/wp-content/uploads/2018/04/instagram-banner-01.png?ssl=1",
      "tags": [
        "instagram"
      ],
      "id": "_xphhxtz"
    },
    {
      "title": "Apple’s New iPad Mini Is a Powerful Throwback",
      "content": "Apple’s new iPad Mini, however, is a design throwback, thawed like Sylvester Stallone’s cryogenically frozen Demolition Man to tackle the tablet challenges of a new generation of users.\n\nAt a glance, the iPad Mini 5 is a match for 2015’s iPad Mini 4, right down to physical Touch ID button. That’s right — Apple has delivered a new tablet with a mechanical home button. In an era when the iPhone hasn’t had a movable home button since 2016, and when the iPhone XS and iPad Pros don’t even have home buttons at all, this decision is mind-boggling. Don’t get me wrong, I’ve always been a fan of that button — but this is 2019, not 2015.",
      "date": "2019-03-28",
      "author": "Lance Ulanoff",
      "image": "https://www.mobozy.com/wp-content/uploads/2017/10/apple-banner.jpg",
      "tags": [
        "technologies"
      ],
      "id": "_de7jbhz"
    },
    {
      "title": "What If Mark Zuckerberg Had Stayed in School?",
      "content": "This month, Facebook founder Mark Zuckerberg has announced yet another new direction for his famously bad-acting company. Now, he says, the platform once responsible for the Cambridge Analytica election fiasco and countless other personal invasions will become the poster child for privacy and encryption. Maybe after all the evasions, missteps, and pivots, Zuckerberg is finally learning from his experiences.\n\nBut as I watch Mark Zuckerberg zig and zag his way through one disaster after another, I can’t help but muse on one of the ways he could have spared himself — and the rest of humanity — all this trouble. What if he had simply stayed in school?\n\nAt the end of his sophomore year, Mark Zuckerberg dropped out of Harvard’s class of 2006 in order to pursue development of Facebook. The social networking platform was already the 10th most trafficked site on the internet, so young Zuck decided to follow in the footsteps of Harvard dropout Bill Gates and pursue Silicon Valley venture capitalists over Cambridge academics.\n\nAfter all, at least by the logic of lean startups, Harvard had already served its purpose. Young Zuck had gained enough programming chops in computer science to build his minimum viable product, and — perhaps more important — he had leveraged the elite student population of Harvard to find the partners and ideas he needed to get a company up and running.\n\nBut by forgoing a college education, Zuckerberg may have denied himself — and the world — the benefit of some historical, cultural, economic, and political context for his work. And we are all now paying the price for his impatience. What if Mark Zuckerberg had decided to stay in school instead? Looking back through Harvard’s course catalogs for 2005 and 2006, one finds a bounty of offerings, from sociology and psychology to philosophy and literature, that would have challenged the assumptions underlying Silicon Valley dogma and might just have given Zuckerberg the insight he needed to build a platform that promoted human cognition and connection, and even democracy itself, instead of undermining them.\n\nFor example, over his four semesters as an upperclassman, Zuckerberg could have availed himself of Harvard professors, including Greg Manciw, former chairman of the President’s Council of Economic Advisers. If Zuck had taken Manciw’s “Principles of Economics” class, he may have recognized that there is a growth-based economic operating system running beneath every Silicon Valley unicorn — one that ultimately demands turning users into products or, worse, data fodder for the algorithms. He may have realized that taking the most investment at the highest valuation would only put his company at the mercy of its shareholders and obligate him to grow by any means necessary.\n\nOr what if he had chosen to study with superstar literary critic Helen Vendler, whose undergraduate course “Literature and the Arts” offered “a study of poetry as the history and science of feeling”? Might Zuckerberg have later been able to predict his platform’s bias for emotional insensitivity, or could he have curtailed the use of language as cognitive weapon?\n\nMaybe that inquiry would have been even better informed by taking Steven Pinker’s course that spring, “The Human Mind,” which covered psychoanalysis, behavioralism, cognitive neuroscience, and evolutionary psychology. Imagine if Zuckerberg had considered human consciousness in an academic or ethical context before setting upon entraining the collective psyche through his news feed algorithms?",
      "date": "2019-04-17",
      "author": " Douglas Rushkoff223",
      "image": "https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F669886370%2F960x0.jpg%3Ffit%3Dscale",
      "tags": [
        "facebook",
        "vfvld"
      ],
      "id": "_ksmzj28"
    },
    {
      "title": "Silicon Valley’s Grow-or-Die Culture Is Costing Us",
      "content": "A number of aspects of this message make me feel uneasy:\n\nThe threatening tone\nAn expectation to work weekends\nThe open, public declaration of there being a watch list and the open, public threat of being put on it\nA “simple rule,” which is that staff who do not hit their KPIs will get fired with no negotiations\nThe Slack emoji reactions: “push,” “get (sh)it done,” a tank, the Mortal Kombat logo — it implies that this is a war and that winning the war must happen at all costs\nNow, don’t get me wrong — I love startups, and I love an audacious belief in taking on the world and winning. However, something is going (or has gone) wrong with startup culture.\n\nI don’t believe that we’ve ended up where we are through malicious intent. However, we are all influenced by the practices and celebrated successes of the famous companies we see publicized in our industry, and those celebrated successes are the “unicorns,” the 10x-growth rebels: hustling hard, being disruptive, vacuuming talent and competitors in a race to become the dominant force in the market.\n\nWe read books, we watch podcasts, we follow influential business people on Twitter, and slowly, with time, we move the norm toward an extreme because of the echo chamber that surrounds us. Building technology has been enabled by, but also heavily tainted by, growth-or-die culture.\n\nCan there not be a middle ground?",
      "date": "2019-04-17",
      "author": " James Staniers",
      "image": "https://i.imgur.com/zYhtf66.jpg",
      "tags": [
        "technologies"
      ],
      "id": "_3q4hofk"
    },
    {
      "id": "_xdrm6an",
      "title": "Regulators Just Put a Target on Apple’s Back",
      "content": "While the tech world’s eyes were fastened on Apple’s annual developer conference Monday, the news with the potential to shake the industry had nothing to do with the Mac Pro, iMessage Memoji, or iOS 13’s Dark Mode. It was the seismic rumbling of antitrust activity emanating from Washington, D.C.\n\nThe tremors began Friday night with a report that the Department of Justice was preparing an antitrust probe of Google. They continued Sunday with word that the Federal Trade Commission might take a closer look at Amazon’s competitive practices. The aftershocks rolled on through Monday, with reports that the DOJ and FTC might also have Apple and Facebook, respectively, in their crosshairs. And then came word that the House Judiciary Committee is planning a sweeping antitrust probe of its own.\n\nWhat it all means isn’t clear just yet. Both the DOJ and FTC have declined comment, leaving others to piece together the patchwork of anonymously sourced reports. It seems that neither has actually launched an investigation yet into any of the companies, which helps to explain why no one has reported on what their nature or focus might be. The probe by House Democrats is the only one that has been formally announced.",
      "date": "2019-06-11",
      "author": "Will Oremus",
      "image": "https://ekgaming.com/wp-content/uploads/2017/12/apple-logo-banner.png",
      "tags": [
        "INDUSTRY",
        " CONSUMER TECH"
      ]
    },
    {
      "id": "_r7hj27b",
      "title": "How I went from 33-year-old museum tour guide to professional Web Developer and UX Designer: My 18-month coding journey",
      "content": "My story is a bit different from the stories you have read so many times. I did not get my first web development job in 3 months. Not in 6 months. Not even in a year. My journey took 18 months, which were tough and frustrating but also exciting and amazing.\n\nMy background, like many other self taught developers, is one that seems as far as possible from any type of technology. I have a Master’s degree in History. I worked as a guide in a museum, as a group facilitator in a non-profit organization, and as a teacher. I loved all of these roles. Otherwise, I wouldn’t have chosen to spend my time doing them.\n\nAt some point I decided to change it all. I wanted to make a bigger impact through my work, especially in non-profit organizations. In addition, after living in 3 countries (in 3 continents) in 6 years, I wanted to start a career that would not require me to find a new job and even a new field each time I move.\n\nI didn’t need much research to conclude that technology can answer both goals. It can fill my passion to contribute in a (probably the most) meaningful way and it could offer me the freedom to move and relocate while continuing my work.\n\nI quit my great job as a teacher, left a nice salary and job security behind, and started to be a “full time web development self learner.” That was my title for quite a long time.\n\nI began learning web development by myself, thinking (af",
      "date": "2019-06-11",
      "author": "Vered Rekanati Mordechai",
      "image": "http://a.rgbimg.com/users/x/xy/xymonau/600/2dyWx2m.jpg",
      "tags": [
        "UX/UI",
        " Design"
      ]
    },
    {
      "id": "_7sj486e",
      "title": "Cybersecurity has never been more important. Here’s how you can keep up.",
      "content": "The past few months have been some of the most substantial in cybersecurity history:\n\n    WikiLeaks released their Vault7 collection of CIA hacks\n    The WannaCry ransomware has infected hundreds of thousands of computers.\n    The FBI is investigating Russia hacking that may have meddled in the U.S. presidential election.\n    Congress voted on a resolution to roll back Federal Communications Commission privacy protections that kept Internet Service Providers from selling your data to third-parties (and opening the door for ISPs to use your data in other creepy ways).\n    And the open web is under threat from mega-corporations who may use deep packet inspection to turn it into a locked-down Chinese-style internet.\n\nIt would be an understatement to say that issues surrounding cybersecurity and digital privacy are “in the news.” Because these issues are a lot closer to home.\nIn fact they’re in your home, literally. In your computers, your smart phones, your smart-home devices, and maybe even your TVs.\n\nWhich means you might be interested in learning more about the field of cybersecurity, because it’s certainly affecting you. Privacy, security, digital rights, free expression, the open web — these are all raging issues that trace back to the fundamental mechanics of networks.\n\nI’m invested in diving deeper into this world. I work as a consultant at Crypho, a Norwegian security software company that builds private and secure communication tools for organizations. And I’m currently in deferral at UC Berkeley Law, where I plan to learn more about digital privacy and security law.\n\nAnd, in order to stay on top of the issues, I subscribe to the following free email newsletters.",
      "date": "2019-06-11",
      "author": "Steven Gilbert",
      "image": "https://www.assured.enterprises/wp-content/uploads/2017/03/Mergers-Acquisitions-Cybersecurity-Banner.png",
      "tags": [
        "cybersecutiry"
      ]
    }
  ],
  "layoutParameters": [
    {
      "col": "6",
      "row": "_r5luzwd",
      "id": "_xphhxtz"
    },
    {
      "id": "_7sj486e",
      "col": "12",
      "row": "_72ouvr8"
    },
    {
      "id": "_r7hj27b",
      "col": "6",
      "row": "_r5luzwd"
    },
    {
      "id": "_ksmzj28",
      "col": "12",
      "row": "_pspbi9o"
    }
  ],
  "rowsInLayout": [
    {
      "id": "_r5luzwd",
      "articlesInRow": [
        "_xphhxtz",
        "_r7hj27b"
      ]
    },
    {
      "id": "_72ouvr8",
      "articlesInRow": [
        "_7sj486e"
      ]
    },
    {
      "id": "_pspbi9o",
      "articlesInRow": [
        "_ksmzj28"
      ]
    }
  ]
}