{
  "articles": [
    {
      "id": "_g5qps8u",
      "title": "As a Designer, I Refuse to Call People ‘Users’",
      "content": "ve worked in UX for the better part of a decade. From now on, I plan to remove the word “user” and any associated terms—like “UX” and “user experience”—from my vocabulary. It’ll take time. I’ll start by trying to avoid using them in conversations at work. I’ll erase them from my LinkedIn profile. I’ll find new ways to describe my job when making small talk. I will experiment and look for something better.\n\nI don’t have any strong alternatives to offer right now, but I’m confident I’ll find some. I think of it as a challenge. The U-words are everywhere in tech, but they no longer reflect my values or my approach to design and technology. I can either keep using language I disagree with, or I can begin to search for what’s next. I choose to search.",
      "date": "2019-03-12",
      "author": "Adam Lefton",
      "tags": []
    },
    {
      "id": "_5gs142p",
      "title": "asdfasdf =====>",
      "content": "asdfasdf",
      "date": "2019-03-15",
      "author": "asdfasdf",
      "tags": [
        {
          "id": "asdfasdf",
          "text": "asdfasdf"
        }
      ]
    }
  ],
  "layoutContainers": [
    {
      "title": "Reflecting on My Failure to Build a Billion-Dollar Company",
      "content": "I thought Gumroad would become a billion-dollar company, with hundreds of employees. It would IPO, and I would work on it until I died. Something like that.\n\nNeedless to say, that didn’t happen.\n\nNow, it may look like I am in an enviable position, running a profitable, growing, low-maintenance software business serving adoring customers. But for years, I considered myself a failure. At my lowest point, I had to lay off 75 percent of my company, including many of my best friends. I had failed.\n\nIt took me years to realize I was misguided from the outset. I no longer feel shame in the path I took to get to where I am today — but for a long time, I did. This is my journey, from the beginning.",
      "date": "2019-03-11",
      "author": "Max Voloskiy",
      "tags": [
        {
          "id": "#failure",
          "text": "#failure"
        },
        {
          "id": "#business",
          "text": "#business"
        },
        {
          "id": "#success",
          "text": "#success"
        }
      ],
      "id": "_4xhxitr"
    },
    {
      "title": "A Technique for Deciding When to Say No",
      "content": "In a culture that tends toward the myth of no limits, acknowledging that we can’t do everything seems restrictive. Our industrial naïveté proudly proclaims that we have unlimited time, unlimited resources, and unlimited capacity. Our enlightened progress that emerged in modernism has told us that supply is infinite, demand is infinite, and we, too, are infinit.",
      "date": "2019-03-15",
      "author": "Adam Frank",
      "tags": [],
      "id": "_qqp2mzd"
    }
  ]
}